 using CoreTweet;
using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.Linq;
using System.Text;
using System.Threading;
using System.Threading.Tasks;

namespace Twitter_bot
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.OutputEncoding = Encoding.UTF8;
            var rand = new Random();//出力する文字のランダム

            try
            {
                var session = OAuth.Authorize("zsXtwOOlzPr9yr0a0lJF7cQfN", "3Xt6KSoEOOgE7s3wjmyuSmEfwUon0nDOjICZkZs10bSr5bbMsJ");//"api_key", "api_secret"が入る

                Process.Start(session.AuthorizeUri.AbsoluteUri);//認証ブラウザを開く&ピンコードコピー

                Console.Write("PINCODEは？");
                var pincode = Console.ReadLine();//ピンコード入力

                var token = OAuth.GetTokens(session, pincode);//トークン取得
                Console.WriteLine(token);


                while (true)
                {
                    string[] coment = { /*"源氏だったものです" , "はい、、、", "ごめんなさいごめんなさい", "おなかすいた", "おなかいたい", "えっ、、",
                                        "僕はげんきです", "????????????????", "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "わからないけどわからん", "どうもー", "ああああああああああああああああああああああああああああああああああああああああ",
                                        "幼女になりたい", "わけわからんのわかる", "おやすみなさい", "おつかれさまでした", "かなしい", "えっえっ",
                                        "わーーーーーい", "かりんとうたべたい", "ゆかりんかわいい", "らーめんたべたい", "らーめんらーめん", "ねっとくそ",
                                        "おやすみせかい", "おはようせかい", "わかる", "それほんとそれ","ぼくも先輩の財布たべたい","あたまがわるくなりそうだーー",
                                        "あばばばばばばばばばばっば","ぼく優秀","座ってるだけでお金が入ってくる人になりたい","気が向いたらやるはやらない","殺伐としたTL","なんでぼくべんきょうしてるんだろう",
                                        "でがいおにくがたべたい","英語が苦手です","なにそれきれそう","あほのぼくでもわかるようにしてくれ","人の金で焼き肉を食べたい","漢文、古文滅べ","わかりますわかります",
                                        "これおわらないとなにもできないかんじあるな","なにもおもいつかない","これ限界あるのか、","すごくえっちだ、、","なんだかなあ","ねこか石油王になりたい",
                                        "なんだろう、つんだ","なにそれかわいそう","毎日9時間寝たい","すごくひさびさに朝ごはん食べた","わかる（わかったとはいっていない）","寿司を食べたい",
                                        "↑これ僕もそう思います","この感じ意味不明すぎて最高","いみわからん、、","つ     よ     い","CLANNADは人生","Key作品はいいぞ",
                                        "働いてないけど働きたくない","こしがいたい","くびがいたい","ナンのカレー","背後ジー","もうこんなじかんか",
                                        "なんかうまくいかない、、","おいしいもの無限にたべたい","@genshi0916 こっちもよろしくねーーー","かわいい","かっこいい","うーーーん",
                                        "さむいなあ","（しみじみ）","あほなことをしてた","たぶん肩こりらしきものやばい","ぼくにどうしろと、、","尊い、、、、",
                                        "今日の寮飯、あれが料理だとぼくはみとめない","ごめんわからない","にゃーん","ねこねこ","めんどくさっっっっっ","えっ!!!!!!!!!!!!!!!!!!!",
                                        "うん。。。。うん、、","身長ふってこないかな","ぷっちょおいしい","なにもわからないが、なにもわからない","みんなどこからお金と時間を捻出してるか気になる","しなないていどにがんばります",
                                        "なつかしいなあ、","AMD","ねてた","2億円ふってこないかなあ","無にかえりたい","たべられますよたべられるんです",
                                        "↑ぼくもはやくこれになりたい","まだまだたりない","普通に美少女になりたい","ふええぇぇぇ、、","わかいときのぼくにそっくりだ","なるほど",
                                        "人間工学的によさそう","なるほど、わからん","がんばって、ぼく","明日から本気出す","僕抜きでおもしろそうなことしないでください","なかなか限界",
                                        "なんか動いた","たいへんえっち","このアカウントは@genshi0916 がとりあえずTwitter bot 作ってみようと思い作ってみたものです","くそほどどうでもいいツイートしてます","なかなかいいなこれ","なにかがたりない",
                                        "こわすぎる","なかなかにこまった","かなりびっくりした","かわいそう","今からちょっと無になってきます","アイス食べたい",
                                        "//","とりあえずTwitterして落ち着こう","体中謎の痛みが","しってた。","強く生きて","いいラーメン屋おしえてー",
                                        "すこしはよくなったかんじあるな","いやよくわからない","絶起","ぜつぼう","これからねます","今日なにもしてないな",
                                        "日本語むずかしすぎでは","そうですそうです","おっ、、","課題やりたくない助けて","もう少しだけがんばろう","げんきですかーーー",
                                        "何かを極めたい","あとわりともうすこしだ","かなしすぎでは","なにもわからなすぎて心おれる","完全に理解したい","それはそう",
                                        "今から真面目になります","こんにちは","今日もいい天気","虚無","何ツイートしようとしたか忘れたー","がっこういきたくないがとまらない",
                                        "どうも豆腐メンタルです","わかる（わかる）","あたまがまわらないい","IQ3です","あたたたかい","進捗生えてこないかな",
                                        "なんですかそれめちゃくちゃおもしろそうじゃないですか","つまりはこういうこと","毎日テクハラ受けてます","TL活気ありすぎ問題","よさそう","_(ˇωˇ」∠)_ ｽﾔｧ…",
                                        "うううううううううううう","よいぞよいぞ","過去の自分優秀現象がおこってる","！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？！？"
                                       ,*/" @spea55_main "," @0828_Syuu "," @kodamanbou0424 "," @hanakosaber "," @mueru0 "," @quarts_x77 "," @Lachryma_CRASH "," @Dr_purin410 "," @Imai_kousen "," @shade4827 ",
                                          " @saberhanako "," @takahashi_1919 "," @Makigechan "," @ume_mikan03 "," @obgedsbzoztsn "," @Daiki_purin_M23 "," @Xx_RR13LV_xX "," @spea0626 ‏"," @kyouju_Touma ‏",
                                          " @r2y3q "," @genshi0916 "};//ツイート内容


                    string chose = coment[rand.Next(coment.Length)];//内容を選ぶ
                    DateTime dt = DateTime.Now;
                    
                    Console.WriteLine("Tweet" + dt.ToString() + chose +"進捗どうですか");//ツイート

                    try
                    {
                        token.Statuses.Update(status => dt.ToString() + chose + "進捗どうですか");
                    }

                    catch (Exception ex)
                    {
                        Console.WriteLine("Error:" + ex.Message);
                    }

                    Thread.Sleep(1000 * 60 * 60);

                }

            }

            catch (Exception ex)
            {
                Console.WriteLine("Error: " + ex.Message);
            }
            Console.ReadKey();
        }
    }}
